% Задача. Запрограммировать степенной метод,
% найти максимальное и минимальное собственные 
% числа (с.ч.)
% БАЗА (0) Создание матрицы. Нужно создать матрицу с известными с.ч
% Построение основано на свойстве подобного преобразования,
% которое не изменяет с.ч. матрицы.
% 1 способ. При помощи невырожденной матрицы В. Если есть диагональная
% матрица D (с с.ч. на диагонали), то у матрицы А=B^(-1)DB будут те же
% самые с.ч. Матрица А в общем случае не будет симметричной.
% Положительная определенность зависит от знаков элементов диагональной 
% матрицы D
