%2 cftool МНК:
% Степень: I       II       III      IV
% p1 =  -0.3316  -0.5113   0.9649   0.0659
% p2 =   2.128    2.225   -7.748    0.3059
% p3 =           -0.3762  17.97    -5.505
% p4 =                    -9.586   15
% p5 =                             -8.35
% Наиболее близкие значения при приближении 3-й степени.
% Если степень полинома на 1 меньше количества точек, то ошибка, в идеале,
% Равна нулю, т.к. такой полином проходит через каждую точку данных.
% В действительности, остаётся ошибка округления машинной арифметики.


%3 cftool c выбросами
y1 = y; y1(1:10:end) = 10;
%3.3
% bisquare I       II      III      IV
% p1 =  -0.5086  -0.544    1      -1.623e-15
% p2 =   2.933    2.282   -8.1     1
% p3 =           -0.0615  19.04   -8.1
% p4 =                   -10.56   19.04
% p5 =                           -10.56

%3.4
% LAR     I       II      III      IV
% p1 =  -0.8056  -0.4      1      -7.968e-14
% p2 =   3.747    1.318   -8.1     1
% p3 =            1.347   19.04   -8.1
% p4 =                   -10.56   19.04
% p5 =                           -10.56

%4 cftool сглаживающие сплайны

%5.1

plot(x,y,'b.'); hold on; grid on;
pp = csaps(x, y, 0.8);
yt = fnval(pp, t); plot(t, yt,'r');
saveas(gcf, '19.png');















